2m3_27mm_wall_H2_test_59/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.02e-9; //updated

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    bottom_wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField; //placeholder
    }
    nozzle_27mm_5mm_27cm
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    nozzle
    {
        // ε auto-scales with k. L = 0.07×D = 0.07×27mm = 1.89e-3 m.
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1.89e-3;
        value           uniform 3.02e-9;
    }
    box_shell_2m3
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}
// ************************************************************************* //
